---
kind: method
id: M:Autodesk.Revit.DB.Macros.ApplicationEntryPoint.#ctor
source: html/6dc3d1ae-4b53-d5e5-c213-1f4288b85f08.htm
---
# Autodesk.Revit.DB.Macros.ApplicationEntryPoint.#ctor Method

Initializes a new instance of the ApplicationEntryPoint class

## Syntax (C#)
```csharp
public ApplicationEntryPoint()
```